{
  "backend/main.mo": "Motoko actor managing inquiries and user profiles with admin and user authorization, supporting submission, retrieval, update, and deletion of inquiries.",
  "feature_evidence.json": "Feature evidence metadata linking admin dashboard behavior to related frontend files, components, and test requirements.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purpose and behavior of each major frontend file in the project.",
  "frontend/index.css": "Tailwind base styles defining light and dark mode OKLCH color tokens and global element styling.",
  "frontend/index.html": "Root HTML shell loading the React frontend and mounting the app at the root element.",
  "frontend/PREVIEW_VALIDATION_CHECKLIST.md": "Checklist for validating preview deployments to ensure backend and UI function correctly before production.",
  "frontend/PRODUCTION_SMOKE_TEST.md": "Detailed production smoke test covering login flow, admin dashboard behavior, inquiry management, and error recovery steps.",
  "frontend/public/404.html": "SPA fallback page that preserves the requested path in sessionStorage before redirecting to the root for client-side routing.",
  "frontend/public/admin/index.html": "Static HTML entry point for the admin section loading the same SPA bundle as the main app.",
  "frontend/src/App.tsx": "Main app component handling routing, deep-link restoration, admin access guard, and rendering public or admin pages.",
  "frontend/src/components/admin/AdminLoginPrompt.tsx": "Empty placeholder file with no implemented logic.",
  "frontend/src/components/admin/InquiryActions.tsx": "Supplies per‑inquiry admin actions for marking read/unread and deleting, plus bulk export utilities for JSON and CSV.",
  "frontend/src/components/admin/InquiryList.tsx": "Displays and filters inquiries with search, type/category filters, and bulk read/unread actions.",
  "frontend/src/components/admin/OfficialLoginDialog.tsx": "A modal login dialog for officials with credential input, validation, error display, and success callback.",
  "frontend/src/components/BrandMark.tsx": "Simple logo component displaying the Vaishnavi brand image in configurable sizes.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary showing a Hindi error UI with reset button and minimal diagnostic info.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with business info, disclaimer, and a Caffeine.ai attribution link.",
  "frontend/src/components/InquiryForm.tsx": "Provides a validated inquiry submission form supporting contact and service requests, with success and error handling.",
  "frontend/src/components/NavigationBar.tsx": "Implements a responsive navigation bar with scroll detection, section scrolling, and mobile menu support.",
  "frontend/src/components/sections/AdminLoginSection.tsx": "Empty file with no implementation.",
  "frontend/src/components/sections/ContactSection.tsx": "Renders a contact section showing address, operator, phone, and WhatsApp links using siteContent values.",
  "frontend/src/components/sections/FormSection.tsx": "Displays a contact form section with a header and InquiryForm inside a styled card.",
  "frontend/src/components/sections/HeroSection.tsx": "Shows the hero banner with business name, tagline, call/WhatsApp buttons, location, and an admin login dialog.",
  "frontend/src/components/sections/ServicesSection.tsx": "Lists all service categories and items from siteContent as cards in a responsive grid.",
  "frontend/src/components/sections/WhyChooseUsSection.tsx": "Displays reasons to choose the business using icons and text pulled from siteContent.",
  "frontend/src/content/siteContent.ts": "Exports all static business content including hero text, services, reasons, and footer notes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, reinitializing when identity changes.",
  "frontend/src/hooks/useAdminActor.ts": "Handles admin-specific actor creation with token-based initialization, retry logic, and error handling.",
  "frontend/src/hooks/useAdminInquiries.ts": "Fetches all admin inquiries using the admin actor with self-healing, retries, and guarded query enabling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity auth, initializing AuthClient, handling login state, and exposing identity and login controls.",
  "frontend/src/hooks/useOfficialAdminToken.ts": "Reads and tracks an admin token from sessionStorage, updating state on custom auth-change and storage events.",
  "frontend/src/hooks/useOfficialLogin.ts": "Implements simple official admin login using hardcoded credentials, storing session state and token, and syncing changes via events.",
  "frontend/src/hooks/useQueries.ts": "Defines a React Query mutation for submitting inquiries through the backend actor.",
  "frontend/src/index.css": "Tailwind base stylesheet defining light/dark theme CSS variables and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page handling login gating, admin actor initialization, inquiry fetching, error handling, and UI rendering.",
  "frontend/src/utils/adminError.ts": "Utility for extracting readable error messages and categorizing admin-related errors such as authorization or replica issues.",
  "frontend/src/utils/inquiryExport.ts": "Exports inquiries as JSON or CSV, formatting timestamps and safely escaping CSV fields.",
  "frontend/src/utils/navigation.ts": "Provides a helper for SPA navigation by updating history and dispatching popstate events.",
  "frontend/src/utils/urlParams.ts": "Utilities to read URL parameters (query and hash), store and retrieve them from sessionStorage, and manage persisted URL parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, container settings, animations, and integrating typography, container queries, and animation plugins.",
  "project_state.json": "Snapshot of project configuration describing site purpose, admin login requirements, architectural notes, and known issues with admin dashboard and deployment."
}