{
  "backend/main.mo": "Main canister logic implementing inquiries, user profiles, and admin/user authorization with role checks and mutations.",
  "backend/migration.mo": "Defines migration types and returns old state unchanged during upgrades.",
  "feature_evidence.json": "Feature evidence metadata listing features, involved files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend source files for documentation or build planning.",
  "frontend/index.css": "Global Tailwind styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Base HTML template loading the React app root and main entrypoint.",
  "frontend/PREVIEW_VALIDATION_CHECKLIST.md": "Checklist to verify preview environment readiness before testing admin login and dashboard.",
  "frontend/PRODUCTION_SMOKE_TEST.md": "Smoke‑test instructions for validating production deployment functionality and admin flows.",
  "frontend/public/404.html": "SPA fallback page that stores the requested path and redirects to root for client-side routing.",
  "frontend/public/admin/index.html": "Admin HTML entry page mounting the React app for the /admin route.",
  "frontend/src/App.tsx": "Top-level React app with routing, admin guard, deep-link restoration, and main site sections.",
  "frontend/src/components/admin/AdminLoginPrompt.tsx": "Empty or placeholder admin login prompt component.",
  "frontend/src/components/admin/InquiryActions.tsx": "Provides per-inquiry admin actions like marking read/unread, deleting, and includes bulk export helpers.",
  "frontend/src/components/admin/InquiryList.tsx": "Admin list view that filters, searches, and bulk-updates inquiries with detailed UI controls.",
  "frontend/src/components/admin/OfficialLoginDialog.tsx": "Modal dialog for official login with form validation, loading state, and success callback.",
  "frontend/src/components/BrandMark.tsx": "Reusable logo image component with configurable sizing.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that displays a styled error screen and resets by reloading the homepage.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with business info, disclaimer, and a caffeine.ai attribution link.",
  "frontend/src/components/InquiryForm.tsx": "Form for submitting inquiries with validation, API submission, and success/error alerts.",
  "frontend/src/components/NavigationBar.tsx": "Responsive navigation bar with scroll-based styling and smooth-scrolling section links.",
  "frontend/src/components/sections/AdminLoginSection.tsx": "Empty or placeholder admin login section component.",
  "frontend/src/components/sections/ContactSection.tsx": "Renders a contact section showing business address, operator, phone, and WhatsApp links using siteContent.",
  "frontend/src/components/sections/FormSection.tsx": "Displays a centered inquiry form inside a styled card with title and description.",
  "frontend/src/components/sections/HeroSection.tsx": "Implements the hero banner with business info, call/WhatsApp buttons, and an official login dialog trigger.",
  "frontend/src/components/sections/ServicesSection.tsx": "Shows categorized service cards generated from siteContent, each listing related service items.",
  "frontend/src/components/sections/WhyChooseUsSection.tsx": "Renders a grid of reasons to choose the business, sourced from siteContent.",
  "frontend/src/content/siteContent.ts": "Provides all static site content including business details, hero text, services, and footer metadata.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to Internet Identity, auto‑invalidating dependent queries on change.",
  "frontend/src/hooks/useAdminActor.ts": "Admin-specific actor hook that initializes access control with an admin token, supports timeouts, retries, and detailed error handling.",
  "frontend/src/hooks/useAdminInquiries.ts": "Provides hooks for fetching, deleting, and updating inquiry read status using the admin actor with error handling and cache invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading identities, login flow, and status tracking.",
  "frontend/src/hooks/useOfficialAdminToken.ts": "Reads and tracks the admin token from sessionStorage, updating state on custom or storage events.",
  "frontend/src/hooks/useOfficialLogin.ts": "Implements a simple official login system using hardcoded credentials, storing session state and notifying listeners.",
  "frontend/src/hooks/useQueries.ts": "Defines a mutation hook that submits inquiries to the backend using the authenticated actor.",
  "frontend/src/index.css": "Sets global Tailwind-based theme variables and styles for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page handling login state, data fetching, session errors, and inquiry display actions.",
  "frontend/src/utils/adminError.ts": "Utility functions for parsing errors, detecting authorization or replica issues, and extracting replica rejection details.",
  "frontend/src/utils/inquiryExport.ts": "Exports inquiries to JSON or CSV with formatting helpers for timestamps and CSV-safe values.",
  "frontend/src/utils/navigation.ts": "Provides a navigation helper that updates browser history and triggers SPA routing events.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash-based), store/retrieve them in sessionStorage, and persist or clear them across navigation.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, radius, shadows, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project state, requirements, admin login workflow, known issues, and current architectural notes for the Vaishnavi E‑Mitra & CSC website."
}