{
  "backend/main.mo": "Motoko backend managing inquiries and user profiles with admin‑restricted read/delete actions and basic health check.",
  "feature_evidence.json": "Empty feature‑evidence report placeholder.",
  "frontend-file-summaries.txt": "Text file containing human‑written summaries of all frontend source files.",
  "frontend/index.css": "Global Tailwind CSS setup defining color tokens, variables, and light/dark theme styles.",
  "frontend/index.html": "Root HTML page bootstrapping the frontend with Hindi title and main script entry.",
  "frontend/PREVIEW_VALIDATION_CHECKLIST.md": "Checklist for validating preview deployments, including canister status, homepage checks, inquiry flow, and admin login behavior.",
  "frontend/PRODUCTION_SMOKE_TEST.md": "Production smoke‑test checklist covering homepage, contact info, inquiry submission, admin login, and backend canister health.",
  "frontend/public/404.html": "SPA fallback page that captures unknown routes and redirects to root while preserving the intended path.",
  "frontend/public/admin/index.html": "HTML entry point for the admin route loading the same frontend bundle.",
  "frontend/src/App.tsx": "Main app router handling homepage layout and admin route guard with deep‑link restoration and redirect logic.",
  "frontend/src/components/admin/AdminLoginPrompt.tsx": "Empty placeholder component file with no implementation.",
  "frontend/src/components/admin/InquiryActions.tsx": "Provides per-inquiry admin actions such as marking read/unread, deleting, and bulk exporting inquiries.",
  "frontend/src/components/admin/InquiryList.tsx": "Admin interface for filtering, searching, and managing inquiries with bulk read/unread actions.",
  "frontend/src/components/admin/OfficialLoginDialog.tsx": "Login dialog for officials with form validation, error handling, and authentication workflow.",
  "frontend/src/components/BrandMark.tsx": "Logo component rendering the Vaishnavi image at selectable sizes.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that displays a styled fallback UI and allows users to reset and reload the app.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with business details, disclaimer text, and attribution links.",
  "frontend/src/components/InquiryForm.tsx": "Interactive inquiry form with validation, submission handling, and success/error alerts.",
  "frontend/src/components/NavigationBar.tsx": "Responsive navigation bar with scroll-based styling, smooth section scrolling, and mobile menu support.",
  "frontend/src/components/sections/AdminLoginSection.tsx": "Empty placeholder section file with no implementation.",
  "frontend/src/components/sections/ContactSection.tsx": "Displays contact details including address, operator, phone, WhatsApp, email, and hours using siteContent.",
  "frontend/src/components/sections/FAQSection.tsx": "Renders an FAQ accordion populated from siteContent.faqs inside a styled card.",
  "frontend/src/components/sections/FormSection.tsx": "Wraps and displays an InquiryForm inside a styled card section.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero banner showing business intro, call/WhatsApp buttons, login dialog trigger, and background image.",
  "frontend/src/components/sections/MissionVisionSection.tsx": "Shows mission and vision text from siteContent inside a styled card.",
  "frontend/src/components/sections/ServicesSection.tsx": "Displays service categories with accordion-based detailed items sourced from siteContent.services.",
  "frontend/src/components/sections/WhyChooseUsSection.tsx": "Renders a grid of reasons to choose the business using icons and text from siteContent.whyChooseUs.",
  "frontend/src/content/siteContent.ts": "Provides static structured content for business info, hero text, mission, services, and more.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries on changes.",
  "frontend/src/hooks/useAdminActor.ts": "Creates and manages an admin-capable backend actor with token-based initialization, retry logic, and readiness tracking.",
  "frontend/src/hooks/useAdminInquiries.ts": "Provides React Query hooks for fetching and mutating admin inquiries with self-healing on authorization failures.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context and provider for loading, storing, and managing user identities and login state.",
  "frontend/src/hooks/useOfficialAdminToken.ts": "Reads and syncs the admin secret token from session storage, updating on auth-related events.",
  "frontend/src/hooks/useOfficialLogin.ts": "Implements a simple official login system that stores a session flag and admin token with event-based syncing.",
  "frontend/src/hooks/useQueries.ts": "Provides a mutation hook to submit an inquiry using the standard (non-admin) backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers and renders the root component.",
  "frontend/src/pages/AdminPage.tsx": "React admin dashboard page handling login state, admin actor initialization, inquiry fetching, and error/retry UI flows.",
  "frontend/src/utils/adminError.ts": "Utility helpers for parsing admin-related errors, detecting authorization and replica issues, and extracting rejection details.",
  "frontend/src/utils/inquiryExport.ts": "Exports inquiry data to JSON or CSV, including CSV escaping, timestamp formatting, and type labeling.",
  "frontend/src/utils/navigation.ts": "Provides SPA navigation by updating browser history and dispatching popstate events.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, containers, and enabling typography and container-queries plugins.",
  "project_state.json": "Metadata describing project state, requirements, issues, and admin-login behavior for the Vaishnavi E‑Mitra website."
}