{
  "backend/main.mo": "Motoko backend managing inquiries and user profiles with admin/user access control and CRUD operations for inquiries.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing functionality of various frontend React components, hooks, pages, and utilities.",
  "frontend/index.css": "Global Tailwind CSS variables and theme configuration for light/dark modes with OKLCH colors.",
  "frontend/index.html": "Root HTML file bootstrapping the SPA with main.tsx and mounting #root.",
  "frontend/PRODUCTION_SMOKE_TEST.md": "Manual production smoke‑test checklist covering login, admin, homepage, and inquiry workflows.",
  "frontend/public/404.html": "SPA fallback page that stores the requested path then redirects to root for client‑side routing.",
  "frontend/public/admin/index.html": "Admin HTML entry point loading the SPA for the /admin route.",
  "frontend/src/App.tsx": "Main React app handling routing, admin guard, deep‑link restoration, and rendering core site sections.",
  "frontend/src/components/admin/AdminLoginPrompt.tsx": "Empty component file with no implemented content.",
  "frontend/src/components/admin/InquiryActions.tsx": "Admin controls for marking inquiries read/unread, deleting them, and includes bulk export utilities.",
  "frontend/src/components/admin/InquiryList.tsx": "Admin panel list with search, filters, bulk actions, and detailed rendering of inquiry metadata.",
  "frontend/src/components/admin/OfficialLoginDialog.tsx": "Dialog for official login with form validation, loading state, and callback on successful login.",
  "frontend/src/components/BrandMark.tsx": "Logo component rendering the Vaishnavi PNG with size variants.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that catches runtime errors and displays a styled fallback UI with a reset-to-home button.",
  "frontend/src/components/Footer.tsx": "Renders site footer with business details, disclaimer, copyright, and a caffeine.ai credit link.",
  "frontend/src/components/InquiryForm.tsx": "Form for submitting inquiries with validation, success/error alerts, and API submission via useSubmitInquiry.",
  "frontend/src/components/NavigationBar.tsx": "Responsive navigation bar with scroll detection, smooth section scrolling, and mobile menu toggle.",
  "frontend/src/components/sections/AdminLoginSection.tsx": "Empty section file with no implemented content.",
  "frontend/src/components/sections/ContactSection.tsx": "Renders a contact section showing business address, operator, and phone/WhatsApp buttons using siteContent.",
  "frontend/src/components/sections/FormSection.tsx": "Displays a centered card containing the inquiry form with a title and description.",
  "frontend/src/components/sections/HeroSection.tsx": "Implements the hero banner with business intro, call/WhatsApp actions, location, and an official login dialog.",
  "frontend/src/components/sections/ServicesSection.tsx": "Lists service categories and items from siteContent in responsive cards.",
  "frontend/src/components/sections/WhyChooseUsSection.tsx": "Shows a grid of reasons to choose the business pulled from siteContent.",
  "frontend/src/content/siteContent.ts": "Provides static site content including business info, hero text, services, reasons, and footer disclaimer.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on user identity, initializing access control and invalidating dependent queries on changes.",
  "frontend/src/hooks/useAdminActor.ts": "Builds an admin-capable actor using identity and admin token, initializing access control and invalidating admin queries when updated.",
  "frontend/src/hooks/useAdminInquiries.ts": "Provides hooks to fetch, delete, and update inquiry read status via the admin actor with error handling and query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, handling login state and stored identities.",
  "frontend/src/hooks/useOfficialAdminToken.ts": "Retrieves and tracks the admin token from sessionStorage, updating state on custom or storage events.",
  "frontend/src/hooks/useOfficialLogin.ts": "Implements official admin login with hardcoded credentials, storing session state and token, plus logout and event-based sync.",
  "frontend/src/hooks/useQueries.ts": "Defines a React Query mutation for submitting inquiries through the backend actor.",
  "frontend/src/index.css": "Sets global Tailwind styles and custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page that requires official login, fetches and displays inquiries, and handles errors and logout.",
  "frontend/src/utils/adminError.ts": "Utilities to extract readable error messages, detect authorization errors, and normalize thrown values.",
  "frontend/src/utils/inquiryExport.ts": "Provides CSV and JSON export utilities for inquiry data, including formatting and value escaping.",
  "frontend/src/utils/navigation.ts": "SPA navigation helper that updates browser history and triggers routing via popstate events.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, storing them in sessionStorage, and synchronizing persisted values.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom OKLCH color tokens, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, admin-login requirements, Hindi site content notes, known issues, and existing features for the Vaishnavi E-Mitra & CSC website."
}