{
  "backend/main.mo": "Motoko actor managing inquiries and user profiles with admin-guarded CRUD operations using access control.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of various frontend files for quick reference.",
  "frontend/index.css": "Tailwind base and custom CSS theme variables defining colors, radii, and dark mode styles.",
  "frontend/index.html": "Main HTML entrypoint mounting the React app and loading the Vite bundle.",
  "frontend/public/404.html": "SPA fallback page that redirects unknown routes to root for client-side routing.",
  "frontend/public/admin/index.html": "Admin HTML entrypoint mounting the React app for the /admin path.",
  "frontend/src/App.tsx": "Root component configuring SPA routing and rendering AdminPage when the official login session is active.",
  "frontend/src/components/admin/AdminLoginPrompt.tsx": "Empty placeholder component file.",
  "frontend/src/components/admin/InquiryActions.tsx": "Provides inquiry action menu for marking read/unread, deleting, and exporting inquiries with confirmation dialogs.",
  "frontend/src/components/admin/InquiryList.tsx": "Displays inquiries with filters, timestamps, metadata, and integrates InquiryActions for managing each item.",
  "frontend/src/components/admin/OfficialLoginDialog.tsx": "Login dialog allowing officials to authenticate using user ID and password with error handling.",
  "frontend/src/components/BrandMark.tsx": "Logo component rendering the Vaishnavi brand image with configurable sizes.",
  "frontend/src/components/Footer.tsx": "Footer showing business info, disclaimer, copyright, and Caffeine.ai attribution.",
  "frontend/src/components/InquiryForm.tsx": "Validated inquiry submission form posting inquiries via React Query with success and error handling.",
  "frontend/src/components/NavigationBar.tsx": "Responsive navigation bar with scroll-aware styling, section scrolling, and mobile menu toggling.",
  "frontend/src/components/sections/AdminLoginSection.tsx": "Empty section file.",
  "frontend/src/components/sections/ContactSection.tsx": "Renders business contact details including address, operator, phone, and WhatsApp links.",
  "frontend/src/components/sections/FormSection.tsx": "Section containing a card wrapper for the main inquiry form.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero banner with business details, call/WhatsApp buttons, and an admin login dialog trigger.",
  "frontend/src/components/sections/ServicesSection.tsx": "Renders a services section displaying categories and items from siteContent using responsive cards.",
  "frontend/src/components/sections/WhyChooseUsSection.tsx": "Displays a grid of reasons to choose the service, sourced from siteContent with icon-based cards.",
  "frontend/src/content/siteContent.ts": "Provides structured content for business info, hero text, services, reasons, and footer data.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries on identity changes.",
  "frontend/src/hooks/useAdminInquiries.ts": "Hooks for fetching, deleting, and updating inquiry read status through the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, storing identity state and providing login and logout utilities.",
  "frontend/src/hooks/useOfficialLogin.ts": "Implements a simple session-based admin login system using hardcoded credentials.",
  "frontend/src/hooks/useQueries.ts": "Defines a mutation hook for submitting inquiries to the backend actor.",
  "frontend/src/index.css": "Tailwind base styles with custom HSL theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the app with React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page that restricts access via official login and displays, manages, and exports inquiries.",
  "frontend/src/utils/inquiryExport.ts": "Provides helpers to convert inquiries to JSON or CSV, including CSV escaping, timestamp formatting, and localized labels, then triggers client-side file downloads.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters (including hash routes), persisting them in sessionStorage, and clearing them when needed.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme colors, container settings, extended utilities, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing site purpose, admin login requirements, architectural notes, and existing features with versioned state info."
}