{
  "kind": "build_request",
  "title": "High-priority frontend hotfix: stop admin initialization spinner/timeout and trust backend session response",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-140",
      "text": "Update the frontend admin-session initialization flow so it no longer waits for any legacy token-handshake and instead treats any valid/positive backend session response as success: stop the loading spinner immediately and allow the Admin Dashboard to render (and navigate to /admin where applicable).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Frontend अभी भी 'Initializing Spinner' पर 30 सेकंड तक अटकता है और फिर Timeout हो जाता है।",
          "Frontend Client Code अभी भी पुराने 'Token Handshake' का इंतज़ार कर रहा है, जबकि Backend अब सीधा 'User Object' भेज रहा है।",
          "Force Redirect: login() या initializeSession() फंक्शन में ऐसा कोड लिखें कि जैसे ही Backend से कोई भी Positive Response मिले, वह तुरंत Loading बंद करे और Dashboard पर भेज दे।"
        ]
      },
      "acceptanceCriteria": [
        "After Official Login succeeds, navigating to /admin does not remain on the \"Initializing Admin Session\" screen for ~30 seconds; the spinner stops promptly once the backend returns a valid SessionEntity user object.",
        "The frontend considers the backend response successful when a correctly shaped session object is returned (e.g., session.user exists and session.user.role === \"admin\"), without requiring any legacy token-handshake state to complete.",
        "No user-facing timeout occurs if the backend returns a successful session quickly; the UI proceeds to the dashboard view immediately."
      ]
    },
    {
      "id": "REQ-141",
      "text": "Remove any client-side gating that blocks admin initialization or admin queries based on the presence/absence of an admin token (e.g., patterns like `if (!token) return error`), and ensure the admin session relies on the stored official user ID (sessionStorage key `officialUserId`) plus the backend’s returned session object for authorization state.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Remove Client-Side Token Check: अगर Frontend कोड में कहीं भी if (!token) return error लिखा है, तो उसे हटा दें।",
          "Trust Backend: Frontend को कहें कि वह Backend के JSON जवाब को स्वीकार करे और पेज खोल दे।"
        ]
      },
      "acceptanceCriteria": [
        "There is no code path in the Official Login → /admin initialization flow that fails solely because an admin token is missing.",
        "Admin actor initialization remains enabled when `officialUserId` is present (as in current `useAdminActor` behavior) and does not require `caffeineAdminToken` for the K107172621 bypass flow.",
        "If the backend returns a valid admin session object, the frontend does not override it with a local token-required error."
      ]
    },
    {
      "id": "REQ-142",
      "text": "Ensure that after a successful Official Login (User ID `K107172621`, Password `Karauli#34`), the app immediately navigates to `/admin` and the admin session initialization begins deterministically; once initialized, inquiries fetch proceeds without additional manual clicks.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "इसे High Priority पर ठीक करें और Frontend Assets को Redeploy करें।"
        ]
      },
      "acceptanceCriteria": [
        "From the homepage Official Login dialog, upon successful credentials entry, the app navigates to `/admin` automatically.",
        "On `/admin`, the admin actor initialization runs once prerequisites are present and transitions into the normal dashboard state without a long spinner/timeout when the backend is responsive.",
        "If inquiries exist, they appear; if none exist, the dashboard shows the existing empty-state UI or the existing demo fallback (whichever is implemented), but not an initialization timeout screen."
      ]
    },
    {
      "id": "REQ-143",
      "text": "Redeploy the updated frontend assets and run the repository’s documented production smoke test steps relevant to Official Login → `/admin` initialization and inquiry visibility to confirm the hotfix resolves the spinner/timeout issue shown in the uploaded screenshot.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "हाँ, तुरंत Hotfix लगाओ।"
        ]
      },
      "acceptanceCriteria": [
        "A new build is produced and deployed with the frontend changes.",
        "In the deployed environment, Official Login → `/admin` no longer gets stuck on the \"Initializing Admin Session\" screen as shown in the screenshot.",
        "The documented smoke test steps for Official Login and admin dashboard initialization complete without a timeout."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/immutablePaths (e.g., frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*). Compose or extend behavior elsewhere if needed.",
    "Keep all user-facing UI text in English.",
    "Do not change public inquiry submission behavior or the inquiry form UX as part of this hotfix.",
    "Respect the simplified backend bypass model: Official user ID `K107172621` is treated as admin by backend and frontend must trust the backend’s returned session object."
  ],
  "nonGoals": [
    "Backend authorization refactors (backend is reported fixed already for this issue).",
    "Adding new authentication providers or Internet Identity changes.",
    "Changing the overall site marketing content/layout unrelated to the /admin initialization hang."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}