{
  "kind": "build_request",
  "title": "Fix Admin Dashboard “Error loading inquiries” so Official Login can view all inquiries",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-48",
      "text": "Fix the Official Login admin-token authorization flow so that after a successful Official Login, the Admin Dashboard can successfully fetch and display all inquiry submissions (i.e., `getAllInquiries` must succeed and return stored inquiries) without showing “Error loading inquiries. Please try again.”",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "इस समस्या का समाधान करो अभी मुझे सभी पूछताछ देखनी है",
          "हां ठीक करो",
          "Error loading inquiries. Please try again."
        ]
      },
      "acceptanceCriteria": [
        "Log in via Official Login (User ID: K107172621, Password: Karauli#34) and the app navigates to /admin.",
        "On /admin, the inquiry list loads successfully and displays existing inquiries returned by the backend `getAllInquiries` API.",
        "Backend rejects/unauthorized errors no longer occur when the correct `caffeineAdminToken` is present in the same tab session.",
        "Submitting a new inquiry from the public form results in that inquiry appearing in /admin after refresh/refetch."
      ]
    },
    {
      "id": "REQ-49",
      "text": "Ensure React Query and actor initialization reliably re-run when the Official Login token changes within the same tab session, so admin queries always use an actor that has had `initializeAccessControlWithSecret(caffeineAdminToken)` applied before any admin inquiry API calls.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Error loading inquiries. Please try again."
        ]
      },
      "acceptanceCriteria": [
        "After login sets `sessionStorage['caffeineAdminToken']`, the admin actor is recreated/refetched and access-control initialization is invoked before running `getAllInquiries`.",
        "After logout clears the official session and token, attempting to access /admin redirects to / and admin inquiry queries cannot fetch any data.",
        "Changing token state (login/logout) triggers a refetch of the admin inquiries query without requiring a full page reload."
      ]
    },
    {
      "id": "REQ-50",
      "text": "Update the Admin Dashboard error UI to always display the most specific available failure reason (including non-standard errors) instead of the generic “Error loading inquiries. Please try again.”, and keep actions context-appropriate (Logout for auth-related failures; Retry for transient/non-auth failures).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Error loading inquiries. Please try again.",
          "Retry"
        ]
      },
      "acceptanceCriteria": [
        "When an admin inquiry fetch fails, the UI shows a human-readable error message derived from the actual thrown value (Error/message/string/object) whenever possible.",
        "If the error reason indicates authorization failure (e.g., contains “Unauthorized” or “Only admins”), the primary recovery action presented is Logout (not Retry).",
        "If the error is not authorization-related, the UI presents a Retry action that triggers a refetch."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (immutable UI components).",
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional canisters/services.",
    "Preserve the exact Official Login credentials: User ID \"K107172621\" and Password \"Karauli#34\".",
    "Preserve the existing admin secret-token mechanism using the sessionStorage key \"caffeineAdminToken\"."
  ],
  "nonGoals": [
    "Adding new authentication providers (only the existing Official Login + token mechanism is in scope).",
    "Adding new inquiry fields or changing the inquiry form schema.",
    "Publishing to production/live as part of this change (focus only on fixing the inquiry loading issue)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}