{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix frontend production build issues and ensure /admin remains accessible after live publish",
  "requirements": [
    {
      "id": "REQ-13",
      "summary": "Resolve the production publish deployment error for Draft Version 2 and ensure the live site (including hidden /admin route) loads successfully.",
      "acceptanceCriteria": [
        "A production (live) publish completes successfully without deployment errors.",
        "Both backend canister and frontend assets build successfully as part of the live publish pipeline.",
        "After live publish, the main site loads successfully and the hidden /admin route still renders the admin page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useInternetIdentity.ts",
          "operation": "modify",
          "description": "Fix production build/runtime compatibility by replacing unsupported environment access (e.g., process.env) with the bundler-supported env mechanism and ensuring the Internet Identity provider configuration works in production builds."
        },
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Fix TypeScript/production build failures by correctly typing/narrowing the actor initialization call used for access control bootstrap (currently calling a method not present in the typed backend interface). Use the Authorization component’s intended frontend integration pattern for initializing admin access control; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Harden client-side route detection so the hidden admin experience renders reliably for common production URL variants (e.g., /admin and /admin/) while preserving the existing marketing site rendering for all other paths."
        },
        {
          "path": "frontend/public/admin/index.html",
          "operation": "create",
          "description": "Add a static fallback entry for direct navigation to /admin on static hosting setups by serving the SPA entry from /admin/index.html, ensuring the admin page can render even when the host does not rewrite unknown paths to the root HTML."
        },
        {
          "path": "frontend/public/404.html",
          "operation": "create",
          "description": "Add a SPA fallback 404 page that loads the app entry to mitigate static-host deep-link refresh failures, helping ensure the main site and /admin can still load in production when direct navigation would otherwise return a 404."
        }
      ]
    }
  ]
}