{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Stabilize preview /admin session initialization and inquiry visibility (old + new)",
  "requirements": [
    {
      "id": "REQ-62",
      "summary": "Ensure preview /admin reliably initializes the Admin session after Official Login and loads all stored inquiries (previous + new).",
      "acceptanceCriteria": [
        "In the preview deployment, after logging in with Official Login and navigating to /admin, the page does not get stuck on “Initializing admin session…”.",
        "In the preview deployment, /admin does not show “Admin Session Initialization Failed” under normal conditions when the backend canister is running.",
        "The Admin Dashboard shows the inquiry list when inquiries exist, including inquiries submitted before the current session and inquiries submitted after the current session begins.",
        "Submitting a new inquiry from the public form and then opening /admin (or refreshing within /admin) shows the newly submitted inquiry."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAdminActor.ts",
          "operation": "modify",
          "description": "Harden admin actor creation/initialization so it cannot hang indefinitely in preview: add a deterministic initialization timeout, ensure initialization is re-run whenever the Official Login token changes, and ensure query cache invalidation occurs only after successful initialization. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useAdminInquiries.ts",
          "operation": "modify",
          "description": "Make inquiry fetching reliably reflect persisted data by enforcing refetch-on-mount (and reconnect) behavior for the admin inquiry query, while preserving the guard that prevents calls before the admin actor/session is ready (avoids partial/empty loads being treated as final). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Adjust Admin Dashboard loading flow so it transitions out of “Initializing admin session…” deterministically (success -> load inquiries; failure -> error UI), and ensure Refresh triggers a guaranteed refetch once prerequisites are satisfied. Use existing shadcn/ui Card/Alert/Button patterns for consistent UX; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-64",
      "summary": "Show clear English initialization errors with replica rejection details and provide a deterministic Retry that re-creates the admin actor and reruns initialization before any inquiry calls.",
      "acceptanceCriteria": [
        "If the backend replica rejects calls (including canister-stopped), the /admin initialization error UI displays an English primary error message plus optional expandable technical details (reject code and request id when available).",
        "Clicking Retry from the initialization error state forces a fresh admin-actor initialization attempt (new actor + `initializeAccessControlWithSecret`) and then allows inquiries to load without requiring a manual page reload.",
        "The UI never surfaces a user-facing “Actor not available” error during Retry/Refresh flows; if prerequisites are missing, the query must not execute and should present an actionable message instead."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/adminError.ts",
          "operation": "modify",
          "description": "Improve replica rejection parsing to extract reject code and request id from both string messages and structured error objects when available; keep all user-facing admin strings in English and provide a stable shape consumed by the /admin UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useAdminActor.ts",
          "operation": "modify",
          "description": "Ensure Retry is deterministic: fully clear the cached admin actor state, force creation of a fresh actor instance, rerun `initializeAccessControlWithSecret`, and expose enriched error details (including replica rejection metadata) for the UI to render. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useAdminInquiries.ts",
          "operation": "modify",
          "description": "Remove any path that can surface a user-facing “Actor not available” by tightening query/mutation guards (no execution when admin actor/session prerequisites are missing) and returning actionable, English errors when prerequisites are not met. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Update the initialization failure screen to always show a clear English primary message, with an expandable technical details section (reject code and request id when available), and wire Retry to also reset relevant UI state and trigger inquiry loading automatically after successful re-initialization. Use existing shadcn/ui Alert/Button components; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-65",
      "summary": "Document an internal preview validation checklist to confirm the backend canister is running before testing Official Login and /admin.",
      "acceptanceCriteria": [
        "A short, clear checklist exists in repo documentation describing how to confirm the backend canister is running in preview before testing /admin.",
        "Following the checklist results in reproducible verification that Official Login + /admin inquiry loading can be tested without false failures caused by a stopped backend canister."
      ],
      "file_operations": [
        {
          "path": "frontend/PREVIEW_VALIDATION_CHECKLIST.md",
          "operation": "create",
          "description": "Add a concise preview validation checklist documenting how to confirm the backend canister is running before testing Official Login and /admin, and what to do if the canister is stopped (commands and expected outputs)."
        },
        {
          "path": "frontend/PRODUCTION_SMOKE_TEST.md",
          "operation": "modify",
          "description": "Reference/link the new preview validation checklist from the existing testing documentation so preview verification is repeatable and not blocked by a stopped backend canister."
        }
      ]
    }
  ]
}