{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Official Login admin token flow so Admin Dashboard loads inquiries reliably",
  "requirements": [
    {
      "id": "REQ-48",
      "summary": "Ensure Official Login session token enables Admin Dashboard to fetch and display all inquiries without authorization failures.",
      "acceptanceCriteria": [
        "Log in via Official Login (User ID: K107172621, Password: Karauli#34) and the app navigates to /admin.",
        "On /admin, the inquiry list loads successfully and displays existing inquiries returned by the backend `getAllInquiries` API.",
        "Backend rejects/unauthorized errors no longer occur when the correct `caffeineAdminToken` is present in the same tab session.",
        "Submitting a new inquiry from the public form results in that inquiry appearing in /admin after refresh/refetch."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAdminActor.ts",
          "operation": "modify",
          "description": "Make admin actor creation/initialization deterministic for Official Login by ensuring access-control initialization is completed before the actor is considered ready for admin queries, and trigger dependent React Query invalidation when the initialized actor changes (so /admin fetches use the initialized actor). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useAdminInquiries.ts",
          "operation": "modify",
          "description": "Ensure inquiry fetching is tied to the current Official Login token/session so `getAllInquiries` is executed with an actor that has already applied `initializeAccessControlWithSecret(caffeineAdminToken)`, and the inquiry list refreshes when the token/session changes. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-49",
      "summary": "Recreate/refetch admin actor and admin queries when the Official Login token changes within the same tab session.",
      "acceptanceCriteria": [
        "After login sets `sessionStorage['caffeineAdminToken']`, the admin actor is recreated/refetched and access-control initialization is invoked before running `getAllInquiries`.",
        "After logout clears the official session and token, attempting to access /admin redirects to / and admin inquiry queries cannot fetch any data.",
        "Changing token state (login/logout) triggers a refetch of the admin inquiries query without requiring a full page reload."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useOfficialAdminToken.ts",
          "operation": "modify",
          "description": "Ensure the hook reliably emits token changes within the same tab session (Official Login event) so React state updates consistently drive React Query key changes/invalidations for admin actor + admin inquiry queries. Preserve the sessionStorage key \"caffeineAdminToken\". Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useAdminActor.ts",
          "operation": "modify",
          "description": "Adjust React Query keying and/or invalidation so that when the admin token changes (login/logout) the admin actor query reruns, and dependent admin queries are invalidated/refetched (without full reload). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useAdminInquiries.ts",
          "operation": "modify",
          "description": "Update React Query `queryKey` (or invalidation wiring) so the admin inquiries query refetches on admin token changes and never reuses a stale unauthorized result from a pre-login actor. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Ensure /admin behavior remains correct across login/logout: redirect away when not officially logged in, and refresh inquiry list after token changes (via updated hooks) without manual reload. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-50",
      "summary": "Improve Admin Dashboard error UI to show specific failure reasons and present Logout vs Retry based on auth vs transient errors.",
      "acceptanceCriteria": [
        "When an admin inquiry fetch fails, the UI shows a human-readable error message derived from the actual thrown value (Error/message/string/object) whenever possible.",
        "If the error reason indicates authorization failure (e.g., contains “Unauthorized” or “Only admins”), the primary recovery action presented is Logout (not Retry).",
        "If the error is not authorization-related, the UI presents a Retry action that triggers a refetch."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/adminError.ts",
          "operation": "create",
          "description": "Add a small utility to (1) derive a human-readable message from unknown thrown values (Error/string/object/etc.) and (2) detect authorization-related failures (e.g., contains \"Unauthorized\"/\"Only admins\") to drive context-appropriate actions. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Replace the generic “Error loading inquiries. Please try again.” fallback with messaging from the actual error (including non-standard thrown values), and switch primary action: Logout for auth-related failures, Retry for non-auth failures. Keep using existing immutable UI components under frontend/src/components/ui unchanged. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useAdminInquiries.ts",
          "operation": "modify",
          "description": "Align hook-side error normalization with the Admin Dashboard error UI so non-standard thrown values are preserved as meaningful messages where possible (e.g., backend trap reasons), and surfaced to the page for display. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}